Merge pull request #261 from microsoft/vyokky/dev
Vyokky/dev
